Ran Plan for dir: `terraform/kubernetes` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # proxmox_virtual_environment_file.wk_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "wk_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "k3s-cp.cloud-config.yaml" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "backup-nas:snippets/k3s-cp.cloud-config.yaml" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = <<-EOT # forces replacement
                #cloud-config
                write_files:
                runcmd:
                  - hostnamectl set-hostname $(cat /dev/urandom | tr -dc 'a-z0-9' | fold -w 8 | head -n 1)-k3s-cp
              -   - curl -sfL https://get.k3s.io | K3S_URL=https://cp.home.bryanwp.com:6443 K3S_TOKEN=AU95q3+MP8bfQ== sh
              +   - curl -sfL https://get.k3s.io | K3S_URL=https://cp.home.bryanwp.com:6443 K3S_TOKEN=AU95q3+MP8bfQ== sh -s -
            EOT
          ~ file_name = "k3s-cp.cloud-config.yaml" -> "k3s-wk.cloud-config.yaml" # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # proxmox_virtual_environment_vm.kube_wk[0] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "kube_wk" {
      ~ id                      = "550" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "192.168.2.120",
            ],
          - [
              - "10.42.3.0",
            ],
          - [
              - "10.42.3.1",
            ],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::6c32:eff:fe4c:5a96",
            ],
          - [
              - "fe80::5ccd:ecff:fe2a:b4ae",
            ],
          - [
              - "fe80::8cd9:baff:fe9a:fc0b",
            ],
          - [
              - "fe80::146c:dbff:fee8:3702",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "6E:32:0E:4C:5A:96",
          - "5E:CD:EC:2A:B4:AE",
          - "8E:D9:BA:9A:FC:0B",
          - "16:6C:DB:E8:37:02",
        ] -> (known after apply)
        name                    = "wk-polaris-0"
      ~ network_interface_names = [
          - "lo",
          - "eth0",
          - "flannel.1",
          - "cni0",
          - "veth79b0bb87",
        ] -> (known after apply)
      ~ tags                    = [
          - "k8s",
            "terraform",
          + "k8s",
            "wk",
        ]
        # (21 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (7 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-550-disk-0" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ initialization {
          - interface         = "ide2" -> null
          ~ user_data_file_id = "backup-nas:snippets/k3s-cp.cloud-config.yaml" # forces replacement -> (known after apply) # forces replacement
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          ~ mac_address = "6E:32:0E:4C:5A:96" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.kube_wk[1] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "kube_wk" {
      ~ id                      = "551" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "192.168.2.121",
            ],
          - [
              - "10.42.6.0",
            ],
          - [
              - "10.42.6.1",
            ],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::5850:4dff:fe84:2d39",
            ],
          - [
              - "fe80::9052:99ff:fe4c:9776",
            ],
          - [
              - "fe80::303f:eff:fedf:530b",
            ],
          - [
              - "fe80::d415:ecff:fecd:c86d",
            ],
          - [
              - "fe80::b866:1dff:fe01:23",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "5A:50:4D:84:2D:39",
          - "92:52:99:4C:97:76",
          - "32:3F:0E:DF:53:0B",
          - "D6:15:EC:CD:C8:6D",
          - "BA:66:1D:01:00:23",
        ] -> (known after apply)
        name                    = "wk-polaris-1"
      ~ network_interface_names = [
          - "lo",
          - "eth0",
          - "flannel.1",
          - "cni0",
          - "veth7e649f12",
          - "vethdc24293c",
        ] -> (known after apply)
      ~ tags                    = [
          - "k8s",
            "terraform",
          + "k8s",
            "wk",
        ]
        # (21 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (7 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-551-disk-0" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ initialization {
          - interface         = "ide2" -> null
          ~ user_data_file_id = "backup-nas:snippets/k3s-cp.cloud-config.yaml" # forces replacement -> (known after apply) # forces replacement
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          ~ mac_address = "5A:50:4D:84:2D:39" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.kube_wk[2] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "kube_wk" {
      ~ id                      = "552" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "192.168.2.122",
            ],
          - [
              - "10.42.5.0",
            ],
          - [
              - "10.42.5.1",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::7c21:90ff:fe82:f558",
            ],
          - [
              - "fe80::94aa:bcff:fee5:3083",
            ],
          - [
              - "fe80::7476:15ff:fec5:4f3f",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "7E:21:90:82:F5:58",
          - "96:AA:BC:E5:30:83",
          - "8E:D9:BA:9A:FC:0B",
        ] -> (known after apply)
        name                    = "wk-polaris-2"
      ~ network_interface_names = [
          - "lo",
          - "eth0",
          - "flannel.1",
          - "cni0",
        ] -> (known after apply)
      ~ tags                    = [
          - "k8s",
            "terraform",
          + "k8s",
            "wk",
        ]
        # (21 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (7 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-552-disk-0" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ initialization {
          - interface         = "ide2" -> null
          ~ user_data_file_id = "backup-nas:snippets/k3s-cp.cloud-config.yaml" # forces replacement -> (known after apply) # forces replacement
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          ~ mac_address = "7E:21:90:82:F5:58" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.lxc-k8s-cp1.proxmox_virtual_environment_container.lxc will be updated in-place
~ resource "proxmox_virtual_environment_container" "lxc" {
      ~ description   = <<-EOT
            Managed by Terraform
        EOT
        id            = "500"
        tags          = []
        # (6 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.lxc-k8s-cp2.proxmox_virtual_environment_container.lxc will be updated in-place
~ resource "proxmox_virtual_environment_container" "lxc" {
      ~ description   = <<-EOT
            Managed by Terraform
        EOT
        id            = "501"
        tags          = []
        # (6 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.lxc-k8s-cp3.proxmox_virtual_environment_container.lxc will be updated in-place
~ resource "proxmox_virtual_environment_container" "lxc" {
      ~ description   = <<-EOT
            Managed by Terraform
        EOT
        id            = "502"
        tags          = []
        # (6 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

Plan: 4 to add, 3 to change, 4 to destroy.
╷
│ Warning: Redundant empty provider block
│ 
│   on .terraform/modules/lxc-k8s-cp1/proxmox/lxc/data.tf line 1:
│    1: provider "http" {
│ 
│ Earlier versions of Terraform used empty provider blocks ("proxy provider
│ configurations") for child modules to declare their need to be passed a
│ provider configuration by their callers. That approach was ambiguous and is
│ now deprecated.
│ 
│ If you control this module, you can migrate to the new declaration syntax
│ by removing all of the empty provider "http" blocks and then adding or
│ updating an entry like the following to the required_providers block of
│ module.lxc-k8s-cp1:
│     http = {
│       source = "hashicorp/http"
│       configuration_aliases = [
│         http.github,
│       ]
│     }
│ 
│ (and 2 more similar warnings elsewhere)
╵
╷
│ Warning: Deprecated attribute
│ 
│   on .terraform/modules/lxc-k8s-cp1/proxmox/lxc/lxc.tf line 31, in resource "proxmox_virtual_environment_container" "lxc":
│   31:         data.http.github_ssh_key.body
│ 
│ The attribute "body" is deprecated. Refer to the provider documentation for
│ details.
│ 
│ (and 5 more similar warnings elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/kubernetes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://c79e3cbba2de:4141/lock?id=resnostyle%252Fk8s-gitops%252Fterraform%252Fkubernetes%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/kubernetes`
</details>
Plan: 4 to add, 3 to change, 4 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`